// 5. Проверка пароля
// Пользователь вводит пароль. Если пароль равен "admin123",
//  вывести сообщение "Доступ разрешен", иначе — "Неверный пароль".
// let password = "admin123";
// if (password === "admin123") {
//   console.log("Доступ разрешен");
// } else {
//   console.log("Неверный пароль");
// }

// 1. Проверка первой буквы
// Пользователь вводит строку. Нужно проверить, начинается ли
//  строка с буквы "A". Если да — вывести "Строка начинается с A", если
//  нет — "Строка не начинается с A".

// let str = `about`;
// if (str[0] === `a`) {
//   console.log("Строка начинается с A");
// } else {
//   console.log("Строка не начинается с A");
// }

// 2. Определение длины строки
// Пользователь вводит строку. Нужно вывести длину этой строки.
    // let a ="cars"
    // console.log(a.length);
    
// 3. Сравнение строк
// Пользователь вводит две строки. Нужно сравнить их. Если строки
//  одинаковые, вывести "Строки равны", если разные — "Строки не равны".
// let num = "car",
//   num2 = "dog";
// if (num === num2) {
//   console.log("Строки равны");
// } else {
//   console.log("Строки не равны");
// }
// const num3 = num === num2 ? "Строки равны" : "Строки не равны"
// console.log(num3);

// 4. Проверка последней буквы
// Пользователь вводит строку. Нужно проверить, заканчивается ли
//  строка на букву "Z". Если да — вывести "Строка заканчивается на Z", если нет — "Строка не заканчивается на Z".

// 5. Проверка длины строки
// Пользователь вводит строку. Нужно проверить, равна ли длина
// строки 5. Если да — вывести "Длина строки равна 5", если нет — "Длина строки не равна 5".

// 6. Проверка наличия пробела
// Пользователь вводит строку. Нужно проверить, содержит ли
//  строка пробел. Если да — вывести "Строка содержит пробел", если нет — "Пробелов нет".

// 7. Удаление последнего символа
// Пользователь вводит строку. Нужно удалить последний символ строки и вывести результат.
// ? :






// function Car(make, ) {
//     this.make = make;
//     this.model = model;
//     this.year = year;
//   }
  
//   const car1 = new Car('Apple', 'Talon TSi', 1993);
  
//   console.log(car1.make);
//    Expected output: "Eagle"
  